Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: This method performs the same task as the file Manager(_: should Proceed After Error: removing Item At Path:) method and is preferred over that method in macOS 10.6 and later.
ja: このメソッドは、file Manager(_: should Proceed After Error: removing Item At Path:)メソッドと同じ業務を実行して、そのメソッドより、macOS 10.6以降では好まれます。

source: This method performs the same task as the file Manager(_: should Remove Item At:) method, which is preferred over this method in macOS 10.6 and later.
ja: このメソッドは、macOS 10.6以降ではこのメソッドより好まれるfile Manager(_: should Remove Item At:)メソッドと同じ業務を実行します。

source: This method performs the same task as the file Manager(_: should Remove Item At Path:) method and is preferred over that method in macOS 10.6 and later.
ja: このメソッドは、file Manager(_: should Remove Item At Path:)メソッドと同じ業務を実行して、そのメソッドより、macOS 10.6以降では好まれます。

source: This method prioritizes ordering by start date.
ja: このメソッドは、開始日付による順番付けを優先的に扱います。

source: This method provides a means for dynamically discovering multiple bundle resources of the same type.
ja: このメソッドは、同じ型の複数のバンドルリソースを動的に発見するつもりのものを提供します。

source: This method queues the message on the run loop of the main thread using the run loop modes specified in the array parameter.
ja: このメソッドはメッセージを、メインスレッドの実行ループ上でarrayパラメータで指定された実行ループモードを使ってキューに加えます。

source: This method queues the message on the run loop of the target thread using the run loop modes specified in the array parameter.
ja: このメソッドはメッセージを、目標のスレッドの実行ループ上でarrayパラメータで指定した実行ループモードを使ってキューに加えます。

source: This method raises NSFile Handle Operation Exception if attempts to determine the file-handle type fail or if attempts to read from the file or channel fail.
ja: このメソッドはNSFile Handle Operation Exceptionを引き起こします、ファイルハンドル型を決定する試みが失敗するならば、またはファイルや経路から読み込み試みが失敗するならば。

source: This method raises NSInternal Inconsistency Exception if the receiver is not a directory file wrapper.
ja: このメソッドは、レシーバがディレクトリファイルラッパーでないならば、NSInternal Inconsistency Exceptionを引き起こします。

source: This method raises NSInternal Inconsistency Exception if the receiver is not a symbolic-link file wrapper.
ja: このメソッドは、レシーバがシンボリックリンクファイルラッパーでないならば、NSInternal Inconsistency Exceptionを引き起こします。

source: This method raises NSInvalid Argument Exception if the child file wrapper doesn’t have a preferred name.
ja: このメソッドは、NSInvalid Argument Exceptionを引き起こします、もし子ファイルラッパーが優先名を持たないならば。

source: This method raises NSInvalid Argument Exception if you pass nil or an empty value for filename.
ja: このメソッドは、NSInvalid Argument Exceptionを引き起こします、もしあなたがnilまたは空の値をfilenameに渡すならば。

source: This method raises NSInvalid Argument Exception if you pass nil or an empty value for preferred Filename.
ja: このメソッドは、NSInvalid Argument Exceptionを引き起こします、もしあなたがnilまたは空の値をpreferred Filenameに渡すならば。

source: This method raises an range Exception exception if the range parameter represents a range that doesn’t exist in the array.
ja: このメソッドは、rangeパラメータがその配列の中に存在しないある範囲を表すならばrange Exception例外を引き起こします。

source: This method raises an exception if path is nil or contains the empty string.
ja: このメソッドは、pathがnilであるか空文字列を含むならば、例外を引き起こします。

source: This method raises an exception if the file descriptor is closed or is not valid, if the receiver represents an unconnected pipe or socket endpoint, if no free space is left on the file system, or if any other writing error occurs.
ja: このメソッドは、ファイル記述子が閉じられるまたは有効でないならば、レシーバが非接続パイプまたはソケット端点を表すならば、空き容量がファイルシステム上に残されていないならば、または何らかの他の書き込みエラーが起こるならば、例外を引き起こします。

source: This method recurses the specified directory and its subdirectories.
ja: このメソッドは、指定されたディレクトリとそれの下位ディレクトリを再帰します。

source: This method reflects only whether the item should be stored in iCloud because a call was made to the set Ubiquitous(_: item At: destination URL:) method with a value of true for its flag parameter.
ja: このメソッドは、項目がiCloudに格納されるべきかどうかのみを反映します、なぜなら呼び出しはset Ubiquitous(_: item At: destination URL:)メソッドにtrueの値をそれのflagパラメータに対して持つように、なされたからです。

source: This method registers with the runloop of its current context, and depends on that runloop being run on a regular basis to perform correctly.
ja: このメソッドは、それの現在の文脈の実行ループに登録します、そしてその実行ループが通常の原則上で動かされて正しく成し遂げられることをあてにします。

source: This method removes perform requests only in the current run loop, not all run loops.
ja: このメソッドは、全ての実行ループではなく、現在の実行ループにおいてのみ実行要請を取り除きます。

source: This method returns nil on platforms other than macOS.
ja: このメソッドは、macOS以外のプラットホーム上ではnilを返します。

source: This method returns nil if it cannot retrieve the device of the linked-to file.
ja: このメソッドは、それがリンクされたファイルのデバイスを取ってくることができないならば、nilを返します。

source: This method returns an empty array if no matching resource files are found.
ja: このメソッドは、合致するリソースファイルが見つけられないならば、空の配列を返します。

source: This method returns only the locale identifiers for which a bundle would provide localized content.
ja: このメソッドは、それに対してバンドルがローカライズされた内容を提供するであろうロケール識別子だけを返します。

source: This method returns the appropriate path for modern application and framework bundles.
ja: このメソッドは、モダンなアプリケーションおよびフレームワークのバンドルに対して適切なパスを返します。

source: This method reveals every element of the subtree at path, including the contents of file packages (such as apps, nib files, and RTFD files).
ja: このメソッドは、pathでの下位ツリーのすべての要素を明らかにします、ファイルパッケージの内容を含めて（例えばアプリ、nibファイル、そしてRTFDファイルなど）。

source: This method selects the correct unit based on the formatter’s locale, the magnitude of the value, and the is For Food Energy Use property.
ja: このメソッドは、フォーマッタの持つロケール、値の規模、そしてis For Food Energy Useプロパティに基づいて正しい単位を選択します

source: This method sets the count of the data to 0.
ja: このメソッドは、このデータのcountを０に設定します。

source: This method sets up a timer to perform the a Selector message on the current thread’s run loop.
ja: このメソッドは、a Selectorメッセージを現在のスレッドの実行ループ上で実行するためのタイマーを準備します。

source: This method should be implemented in subclasses that want to validate user changes to a string in a field, where the user changes are not necessarily at the end of the string, and preserve the selection (or set a different one, such as selecting the erroneous part of the string the user has typed).
ja: このメソッドは、欄内の文字列へのユーザの変更を検証したいサブクラスにおいて実装されるべきです、そこにおいてユーザのする変更は、必ずしも文字列の終わりにではありません、そして選択の維持（または異なるものを設定すること、例えばユーザがタイプした文字列の誤り部分の選択など）ではありません。

source: This method should be invoked by programs that require the file to always be in a known state.
ja: このメソッドは、常に既知の状態にあるファイルを必要とするプログラムによって発動されるべきです。

source: This method should return NSOrdered Ascending if the receiver is less than object, NSOrdered Descending if the receiver is greater than object, and NSOrdered Same if the receiver and object are equal.
ja: このメソッドは、レシーバがobjectより小さいならばNSOrdered Ascending、レシーバがobjectより大きいならばNSOrdered Descending、そしてレシーバとobjectが等しいならばNSOrdered Sameを返すべきです。

source: This method traverses symbolic links in the path.
ja: このメソッドは、バスでのシンボリックリンクを辿ります。

source: This method treats the “upper” and “left” edges of the rectangle as the ones containing the origin of the rectangle.
ja: このメソッドは、矩形の「上」と「左」端を矩形の原点を含んでいるものとして扱います。

source: This method uses is Equal(_:) to check for object equality.
ja: このメソッドは、is Equal(_:)を使ってオブジェクトの同等性を検査します。

source: This method uses a date formatter configured with the current default settings.
ja: このメソッドは、現在の省略時設定で構成設定された日付フォーマッタを使います。

source: This method views a Rect from the point of view of the user—that is, this method always treats the bottom edge of the rectangle as the one closest to the bottom edge of the user’s screen.
ja: このメソッドは、ユーザのビューのポイントからa Rectを眺めます — すなわち、このメソッドは常に矩形の下端を、ユーザの画面の下端に最も近いものと扱います。

source: This method works only when the original Item URL and new Item URL parameters are located on the same volume.
ja: このメソッドは、original Item URLとnew Item URLパラメータが同じボリューム上に位置する場合にのみ働きます。

source: This method would first look in the Contents/Resources/Documentation directory of the bundle, followed by the Documentation subdirectories of each language-specific .lproj directory.
ja: このメソッドは、最初にバンドルのContents/Resources/Documentationディレクトリ、続けて各言語固有の.lprojディレクトリのDocumentation下位ディレクトリの中をのぞきます。

source: This method, in turn, raises an NSInvalid Argument Exception, and generates an error message.
ja: このメソッドは、順に、NSInvalid Argument Exceptionを引き起こし、そしてエラーメッセージを生成します。

source: This must be a full URL for a directory; if it contains any symbolic links, they must be resolvable.
ja: これは、ディレクトリへの完全URLでなければなりません；それがいくらかシンボリックリンクを含むならば、それらは解決されなければなりません。

source: This must be a full pathname for a directory; if it contains any symbolic links, they must be resolvable.
ja: これは、ディレクトリに対する完全パス名でなければなりません；それが何らかのシンボリックリンクを含むならば、それらは解決されなければなりません。

source: This must be a valid path.
ja: これは有効なパスでなければなりません。

source: This name is normally used as the dictionary key when a child file wrapper is added to a directory file wrapper.
ja: この名前は、子ファイルラッパーがディレクトリファイルラッパーに加えられる場合に、普通はディレクトリキーとして使われます。

source: This notification is posted when an NSFile Handle object establishes a socket connection between two processes, creates an NSFile Handle object for one end of the connection, and makes this object available to observers by putting it in the user Info dictionary.
ja: この通知は、NSFile Handleオブジェクトが２つのプロセス間のソケット接続を確立して、接続の一方の端に対するNSFile Handleオブジェクトを作成して、そしてこのオブジェクトをそれをuser Info辞書の中に置くことによってオブザーバに対して利用可能にする場合に投函されます。

source: This notification is posted when the acceptance policy of the NSHTTPCookie Storage instance has changed.
ja: この通知は、NSHTTPCookie Storageインスタンスの受入方針が変化した場合に投函されます。

source: This notification is posted when the cookies stored in the NSHTTPCookie Storage instance have changed.
ja: この通知は、NSHTTPCookie Storageインスタンスに格納されるクッキーが変化した場合に投函されます。

source: This notification is posted when the file handle determines that data is currently available for reading in a file or at a communications channel.
ja: この通知は、データがファイルにおいてまたは通信経路での読み込みに対して現在利用可能であることをファイルハンドルが決定する場合に投函されます。

source: This notification is posted when the file handle reads all data in the file or, if a communications channel, until the other process signals the end of data.
ja: この通知は、ファイルハンドルがファイルの中の全てのデータをまたは、もし通信経路ならば、他のプロセスがデータの終端を合図するまで読み込む場合に投函されます。

source: This notification is posted when the file handle reads the data currently available in a file or at a communications channel.
ja: この通知は、ファイルハンドルがファイルにおいてまたは通信経路で現在利用可能なデータを読み込む場合に投函されます。

source: This number will be the count of the new array—it must not be negative or greater than the number of elements in objects.
ja: この数は、新しい配列の総数になります—それは負であったりobjectsの中の要素の数を上回ったりしてははなりません。

source: This object can only be used to operate on the item specified by the url parameter.
ja: このオブジェクトは、urlパラメータによって指定される項目に作用するためだけに使うことができます。

source: This object need not be the same for all messages.
ja: このオブジェクトは、全てのメッセージに対して同じものである必要はありません。

source: This object provides information about the overall matched range, via its range property, and also supplies the capture group ranges, via the range(at:) method.
ja: このオブジェクトは、そのrangeプロパティを通して、全体的なマッチされた範囲に関する情報を提供して、そのうえ、range(at:)メソッドによって、捕獲グループの範囲を供給します。

source: This only adjusts an absolute value.
ja: これは、絶対値を調節するだけです。

source: This option has no effect for methods other than enumerate Matches(in: options: range: using:).
ja: このオプションは、enumerate Matches(in: options: range: using:)メソッド以外には効果がありません。

source: This option is necessary when your application passes a URL in the original Contents URL parameter to the write(to: options: original Contents URL:) method.
ja: このオプションは、あなたのアプリケーションがoriginal Contents URLパラメータの中のURLをwrite(to: options: original Contents URL:)メソッドに渡す場合に必須です。

source: This option should be included if the rectangle is in a flipped coordinate system.
ja: このオプションは含まれなければなりません、もし矩形が反転座標システムにあるならば。

source: This parameter is ignored unless the directory parameter contains the value item Replacement Directory and the domain parameter contains the value user Domain Mask.
ja: このパラメータは、directoryパラメータが値item Replacement Directoryを含むそしてdomainパラメータが値user Domain Maskを含む場合を除いて、無視されます。

source: This parameter is ignored.
ja: このパラメータは無視されます。

source: This parameter must not be nil or contain the empty string.
ja: このパラメータは、nilであってはいけません、または空の文字列を含んではいけません。

source: This parameter must not be nil.
ja: このパラメータは、nilであってはいけません。

source: This path must include the name of the file or directory in its new location.
ja: このパスは、ファイルまたはディレクトリのそれの新しい場所における名前を含まなければなりません。

source: This playground shows how to construct a Grocery Product instance from JSON that looks like this:
ja: このプレイグラウンドは、Grocery Productインスタンスをこのように見えるJSONから組み立てる方法を示します：

source: This playground uses an intermediate type to see how to extract grocery products from JSON that looks like this to skip over unwanted data and structure:
ja: このプレイグラウンドは、ある仲介型を使って雑貨店商品をこのように見えるJSONから抜き出して無用のデータと構造を省く方法を見ます：

source: This playground uses array types as values to see how to work with JSON that’s structured like this:
ja: このプレイグラウンドは、配列型を値として使って、このように組み立てられたJSONを扱う方法を見ます：

source: This process is known as making your types codable.
ja: この過程は、あなたの型をコード化可能にするとして知られています。

source: This property contains true when the file wrapper object is a regular-file wrapper, otherwise it contains false.
ja: このプロパティは、ファイルラッパーオブジェクトが通常ファイルラッパーである場合はtrueを含みます、そうでなければそれはfalseを含みます。

source: This property contains true when the file wrapper object is a symbolic-link file wrapper, false otherwise.
ja: このプロパティは、trueをファイルラッパーオブジェクトがシンボリックリンクファイルラッパーである場合に、そうでなければfalseを含みます。

source: This property contains a boolean value indicating whether the file wrapper is a directory file wrapper.
ja: このプロパティはブール値を含みます、ファイルラッパーがディレクトリファイルラッパーかどうかを指し示しています。

source: This property contains a boolean value that indicates whether the file wrapper object is a regular-file.
ja: このプロパティはブール値を含みます、それはファイルラッパーオブジェクトが通常ファイルかどうかを指し示します。

source: This property contains an NSData object in the format used by the pasteboard type file Contents.
ja: このプロパティは、NSDataオブジェクトを、ペーストボード型file Contentsによって使われる形式で含みます。

source: This property contains the appropriate path for modern application and framework bundles.
ja: このプロパティは、モダンなアプリケーションおよびフレームワークのバンドルに対する適切なパスを含みます。

source: This property contains the file wrapper’s filename, or nil when the file wrapper has no corresponding file-system node.
ja: このプロパティはファイルラッパーの持つファイル名を、またはファイルラッパーが対応するファイルシステムノードを持たない場合はnilを、含みます。

source: This property defaults to medium.
ja: このプロパティは、省略時にはmediumです。

source: This property defaults to a number formatter using the decimal style.
ja: このプロパティは、省略時にはdecimalスタイルを使う数値フォーマッタです。

source: This property is true for -0 .0 and +0 .0 and false for all other values.
ja: このプロパティは、-0 .0と+0 .0に対してtrue、そして全ての他の値に対してfalseです。

source: This property is true when the value is negative or -0 .0; otherwise, false.
ja: このプロパティは、値が負または-0 .0ならばtrueです；そうでなければfalse。

source: This property is key-value observable.
ja: このプロパティは、キー値監視可能です。

source: This property is overridden by the encoder class and instance name to class encoding tables.
ja: このプロパティは、エンコーダクラスとクラスエンコーディングテーブルに対するインスタンス名によってオーバーライドされます。

source: This property is set after ensuring that the code containing the definition of the class is dynamically loaded.
ja: このプロパティは、クラスの定義を含んでいるコードが動的にロードされることを確実にした後に設定されます。

source: This property is used by Cocoa’s scripting support classes.
ja: このプロパティは、Cocoaスクリプティングをサポートするクラスによって使われます。

source: This property makes no guarantee about whether there is a file at the URL—only that if a receipt is present, that is its location.
ja: このプロパティは、ファイルがそのURLにあるかどうかについて保証しません — レシートがあるとしたら、それはその場所だというだけです。

source: This property may contain nil if the user modifies the contents of the file-system node after you call read(from: options:) or init(url: options:) but before NSFile Wrapper has read the contents of the file.
ja: このプロパティは、あなたがread(from: options:)またはinit(url: options:)を呼び出した後にしかしNSFile Wrapperがファイルの内容を読み出し終える前に、ユーザがファイルシステムノードの内容を修正するならばnilを含みます。

source: This property may contain nil if the user modifies the directory after you call read(from: options:) or init(url: options:) but before NSFile Wrapper has read the contents of the directory.
ja: このプロパティは、あなたがread(from: options:)またはinit(url: options:)を呼び出した後にしかしNSFile Wrapperがディレクトリの内容を読み出し終える前に、ユーザがディレクトリを修正するならばnilを含みます。

source: This property may contain nil if the user modifies the file after you call read(from: options:) or init(url: options:) but before NSFile Wrapper has read the contents of the file.
ja: このプロパティは、あなたがread(from: options:)またはinit(url: options:)を呼び出した後にしかしNSFile Wrapperがファイルの内容を読み出し終える前に、ユーザがファイルを修正するならばnilを含みます。

source: This property may contain nil if the user modifies the symbolic link after you call read(from: options:) or init(url: options:) but before NSFile Wrapper has read the contents of the link.
ja: このプロパティは、あなたがread(from: options:)またはinit(url: options:)を呼び出した後にしかしNSFile Wrapperがリンクの内容を読み出し終える前に、ユーザがシンボリックリンクを修正するならばnilを含みます。

source: This property may not be a URL for non-standard bundle formats or for some older bundle formats.
ja: このプロパティは、非標準バンドル形式に対するまたはいくつかのより古いバンドル形式に対するURLではないかもしれません。

source: This property may not contain a URL for non-standard bundle formats or for some older bundle formats.
ja: このプロパティは、非標準バンドル形式に対するまたはいくつかのより古いバンドル形式に対するURLを含まないかもしれません。

source: This property may not contain a path for non-standard bundle formats or for some older bundle formats.
ja: このプロパティは、非標準バンドル形式に対するまたはいくつかのより古いバンドル形式に対するパスを含まないかもしれません。

source: This property performs the canonical (non-localized) mapping.
ja: このプロパティは、正準（非現地語）マッピングを行います。

source: This property raises NSInternal Inconsistency Exception if the file wrapper object is not a directory file wrapper.
ja: このプロパティは、NSInternal Inconsistency Exceptionを引き起こします、もしファイルラッパーオブジェクトがディレクトリファイルラッパーでないならば。

source: This property raises NSInternal Inconsistency Exception if the file wrapper object is not a regular-file file wrapper.
ja: このプロパティは、NSInternal Inconsistency Exceptionを引き起こします、もしファイルラッパーオブジェクトが通常ファイルファイルラッパーでないならば。

source: This property raises NSInternal Inconsistency Exception if the file wrapper object is not a symbolic-link file wrapper.
ja: このプロパティは、NSInternal Inconsistency Exceptionを引き起こします、もしファイルラッパーオブジェクトがシンボリックファイルラッパーでないならば。

source: This property reports the current working directory for the current process, not just the receiver.
ja: このプロパティは、単にレシーバではなく、現在のプロセスに対する現在の作業ディレクトリを報告します。

source: This property returns a proxy for the receiving object if the receiver adopts the NSDiscardable Content protocol and still has content that has not been discarded.
ja: このプロパティは、レシーバであるオブジェクトに対するプロキシ（代理）を、そのレシーバがNSDiscardable Contentプロトコルを採用してなおかつ廃棄されてはいない内容を持つならば、返します。

source: This property uses the preferred localization for the current user when determining which resources to include.
ja: このプロパティは、どのリソースを含めることにするか決定する時に現在のユーザに対する優先ローカライゼーションを使います。

source: This property will contain YES when the file wrapper is a directory file wrapper, otherwise it contains NO.
ja: このプロパティは、ファイルラッパーがディレクトリである場合はYESを含みます、そうでなければそれはNOを含みます。

source: This property’s value is negative if the date object is earlier than 00:00:00 UTC on 1 January 1970.
ja: このプロパティの値は、日付オブジェクトが00:00:00 UTC 1 January 1970より前ならば負になります。

source: This property’s value is negative if the date object is earlier than the system’s absolute reference date (00:00:00 UTC on 1 January 2001).
ja: このプロパティの値は、日付オブジェクトがシステムの絶対基準日（00:00:00 UTC 1 January 2001）より早いならば負です。

source: This relationship occurs when the value of the file Resource Identifier Key is the same for the directory and item.
ja: この関係は、file Resource Identifier Keyの値がディレクトリと項目に対して同じである場合に発生します。

source: This result gives the overall matched range via its range property, and the range of each individual capture group via its range(at:) method.
ja: この結果は、そのrangeプロパティ経由で全体的なマッチされた範囲を、そしてそのrange(at:)メソッドによって捕獲グループそれぞれの範囲を提供します。

source: This returned array does not contain strings for the current directory (“.”), parent directory (“..”), or resource forks (begin with “._”).
ja: この返される配列は、現在のディレクトリ（“.”）、親ディレクトリ（“..”）、またはリソークフォーク（“._” で始まるファイル）に対する文字列を含みません。

source: This sample defines a simple data type, Grocery Product, and demonstrates how to construct instances of that type from several different JSON formats.
ja: このサンプルは、単純なデータ型、Grocery Productを定義します、そしてどのようにその型のインスタンスを幾つかの異なるJSON形式から組み立てるかを実演します。

source: This search pattern means that the bundle looks for resources in the following order:
ja: このサーチパターンは、次の順序でバンドルがリソースを捜すことを意味します：

source: This serialization imposes some restrictions on the objects that can be placed in the notification Info dictionary.
ja: このシリアライズはいくつかの制限を、notification Info辞書の中に置くことができるオブジェクトに課します。

source: This serialization imposes some restrictions on the objects that can be placed in the user Info dictionary.
ja: このシリアライズはいくつかの制限を、user Info辞書の中に置くことができるオブジェクトに課します。

source: This snippet creates a regular expression to match two-letter words, in which the first letter is “a” or “b” and the second letter is “c” or “d”.
ja: この切れっぱしは、最初の文字が“a”または“b”で２番目の文字が“c”または“d”であるところの、２文字単語にマッチする正規表現をつくります。

source: This strategy follows these steps to convert JSON keys to camel-case:
ja: この戦略は、これらの段階に従ってJSONキーをキャメルケースに変換します：

source: This strategy uses uppercase Letters and lowercase Letters to determine the boundaries between words, and the system locale when capitalizing letters.
ja: この戦略は、単語間の境界を決めるのにuppercase Lettersとlowercase Lettersを、そして大文字化の時にsystemロケールを使います。

source: This string is suitable for presentation to the user, explaining the contents and purpose of this cookie.
ja: この文字列はユーザに提示するのに適していて、このクッキーの内容と目的を説明します。

source: This style is most commonly used for time values where the hour, minute, and second values are separated by colons.
ja: このスタイルは、時間値に対して最も普通に使われます、そこで時、分、そして秒の値はコロン隔てられます。

source: This style may fall back to the behavior of abbreviated when attempting to display large time quantities.
ja: このスタイルは、大きな時間量を表示しようと試みる時、abbreviatedの挙動に逆戻りするかもしれません。

source: This style represents the shortest representation of units and quantities of time.
ja: このスタイルは、時間の単位と量の最も短い表現を表します。

source: This table describes which attributes of the file wrapper and node are compared to determine whether the file wrapper needs to be updated:
ja: この表は、ファイルラッパーが更新される必要があるかどうか決定するのに、ファイルラッパーとnodeのどの属性が比較されるかを記述します。

source: This table describes which attributes of the file wrapper and file-system node are compared to determine whether the file wrapper matches the node on disk:
ja: この表は、ファイルラッパーがディスク上のノードと合致するかどうか決定するのに、ファイルラッパーとファイルシステムノードのどの属性が比較されるかを記述します。

source: This thread represents the target thread.
ja: このスレッドは、目標スレッドを表します。

source: This type of distributed notification center handles notifications that can be sent between tasks on a single computer.
ja: この型の分散通知センターは、単一のコンピュータ上のタスク間で送られることができる通知を取り扱います。

source: This type of operation is the same as applying the transformations in a Transform followed by the transformations in the receiver.
ja: この種の演算は、a Transformの変換に続けてレシーバの変換を適用することと同じです。

source: This type of operation is the same as applying the transformations in the receiver followed by the transformations in a Transform.
ja: この種の演算は、レシーバの変換に続けてa Transformの変換を適用することと同じです。

source: This type provides “copy-on-write” behavior, and is also bridged to the Objective-C NSCharacter Set class.
ja: この型は、「コピーオンライト」挙動を提供します、そしてまたObjective-CのNSCharacter Setクラスにブリッジもします。

source: This unit is often used in chemistry.
ja: この単位はしばしば化学において使われます。

source: This unit is used for food calories in some locales.
ja: この単位は幾つかのロケールにおいて食品カロリーに対して使われます。

source: This value is interpreted in the context of the calendar in which it is used.
ja: この値は、それが使われるところのカレンダーの文脈で解釈されます。

source: This value is interpreted in the context of the calendar with which it is used—see Calendars, Date Components, and Calendar Units in Date and Time Programming Guide.
ja: この値は、それが使われるところのカレンダーの文脈で解釈されます — Calendars, Date Components, and Calendar UnitsをDate and Time Programming Guideで見てください。

source: This value must not be nil.
ja: この値は、nilであってはなりません。
